union isfuzzy=true SigninLogs, SecurityEvent, WindowsEvent
| where TimeGenerated > ago(30d)
| where tostring(pack_all()) has_any ("admin", "privileged", "PAW", "SAW", "secure admin")
| summarize Events=count(), LastSeen=max(TimeGenerated) by Type, User=tostring(column_ifexists("UserPrincipalName", column_ifexists("Account", ""))), Computer=tostring(column_ifexists("Computer", ""))
