union isfuzzy=true AzureDiagnostics, CommonSecurityLog, SigninLogs
| where TimeGenerated > ago(30d)
| where tostring(pack_all()) has_any ("admin", "privileged") and tostring(pack_all()) has_any ("internet", "http", "https", "web", "proxy")
| summarize Events=count(), LastSeen=max(TimeGenerated) by Type
